/*******************************************************************************
 * @file    SMU_Source.h
 * @author  Linghu(Linghu0060@qq.com)
 * @version v1.0.0
 * @date    2023/3/23
 * @brief   Source subsystem
 *******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) Wuhan Precise Co.,Ltd</center></h2>
 *
 * The information and source code contained herein is the exclusive
 * property of Wuhan Precise Electronic Technology Co.,Ltd. And may
 * not be disclosed, examined or reproduced in whole or in part without
 * explicit written authorization from the company.
 *
 *******************************************************************************
 * @par Last Commit:
 *      \$Author: User $ \n
 *      \$Date: 2015-02-02 11:01:08 +0800 $ \n
 *      \$Rev: 1 $ \n
 *
 * @par Change Logs:
 *      2023/3/23 -- Linghu -- the first version
 ******************************************************************************/
#ifndef __SMU_SOURCE_H__
#define __SMU_SOURCE_H__
/******************************************************************************/
#include "SMU_Common.h"
/******************************************************************************/
#ifdef  __cplusplus
extern  "C"
{
#endif
/******************************************************************************/
/**
 * @addtogroup App_SOUR
 * @{
 * @addtogroup              Exported_Constants
 * @{
 ******************************************************************************/



/*******************************************************************************
 * @}
 * @addtogroup              Exported_Macros
 * @{
 ******************************************************************************/



/*******************************************************************************
 * @}
 * @addtogroup              Exported_Types
 * @{
 ******************************************************************************/


/*******************************************************************************
 * @}
 * @addtogroup              Exported_Variables
 * @{
 ******************************************************************************/



/*******************************************************************************
 * @}
 * @addtogroup              Exported_Functions
 * @{
 ******************************************************************************/
/**
 * ∏¥Œª
 */
void SOUR_Reset(SMU_CHNL_T chnl);

/**
 * ≥ı ºªØ
 */
int SOUR_Init(void);


/*****************************  END OF FILE  ***********************************
 * @}
 * @}
 */
#ifdef  __cplusplus
}
#endif
#endif  // __SMU_SOURCE_H__
/*****************************  END OF FILE  **********************************/

